ERM/src/Documents/ЗагрузкаДанныхRevenue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗагрузкаДанныхRevenue</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.RevenueByClients</xr:Item>
				<xr:Item>InformationRegister.RevenueSourceData</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛистФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/AccumulationRegisters/RevenueByClients.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>RevenueByClients</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>AmountUSD</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ParentClient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Geomarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubGeomarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/НастройкаСинхронизацииОбъектовСВнешнимиСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкаСинхронизацииОбъектовСВнешнимиСистемами</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектПриемника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъектаВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Catalogs/СтрокиRevenue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СтрокиRevenue</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаДанных</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗагрузкаДанныхRevenue</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиRevenue</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Geomarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubGeomarket</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GeoMarkets</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentClient</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AccountingUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContractName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientContract</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/Documents/ЗагрузкаДанныхRevenue/ObjectModule.bsl
Перем ТаблицаСтрокRevenue Экспорт;
Перем НужнаСинхронизация;

Перем мМассивСтрокRevenueДоЗаписи;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ТаблицаСтрокRevenue = Неопределено Тогда
		ТаблицаСтрокRevenue = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
	КонецЕсли;
	
	ДвиженияRevenueByClients = Движения.RevenueByClients;
	ДвиженияRevenueByClients.Записывать = Истина;
	
	Для каждого ТекСтрокаRevenue Из ТаблицаСтрокRevenue Цикл
		Движение = ДвиженияRevenueByClients.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаRevenue);
		Движение.Период = Дата;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаСтрокRevenue = Неопределено Тогда
		ТаблицаСтрокRevenue = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
		НужнаСинхронизация = Ложь;
	Иначе
		НужнаСинхронизация = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НужнаСинхронизация Тогда
		
		ДобавитьДополнительныеКолонкиВТаблицуСтрокRevenue(ТаблицаСтрокRevenue);
		
		// получим таблицу строк revenue из базы
		ТаблицаСтрокRevenueБазы = Документы.ЗагрузкаДанныхRevenue.ПолучитьТаблицуRevenueLines(Ссылка);
		
		// Синхронизируем таблицу строк revenue со строками в базе данных
		РГСофт.СинхронизироватьСтрокиТаблицыСБазойДанных(ТаблицаСтрокRevenueБазы, ТаблицаСтрокRevenue, Справочники.СтрокиRevenue, Отказ);
		
		// для unallocated clients создаем привязки, чтобы потом видеть историю привязок
		СоздатьПривязкиПоUnallocated(ТаблицаСтрокRevenue);
		
	КонецЕсли;
	
	ТаблицаСтрокRevenue = Неопределено;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеКолонкиВТаблицуСтрокRevenue(ТаблицаСтрокRevenue)
	
	КолонкиТаблицы = ТаблицаСтрокRevenue.Колонки;
	
	Если КолонкиТаблицы.Найти("ЗагрузкаДанных") = Неопределено Тогда
		КолонкиТаблицы.Добавить("ЗагрузкаДанных", Новый ОписаниеТипов("ДокументСсылка.ЗагрузкаДанныхRevenue"));
	КонецЕсли;
	ТаблицаСтрокRevenue.ЗаполнитьЗначения(Ссылка, "ЗагрузкаДанных");
	
КонецПроцедуры

Процедура СоздатьПривязкиПоUnallocated(ТаблицаСтрокRevenue)
	
	ТаблицаСтрокRevenueРасширенная = Документы.ЗагрузкаДанныхRevenue.ДополнитьТаблицуСтрокRevenueДаннымиФайла(ТаблицаСтрокRevenue);
	ТаблицаСтрокRevenueРасширенная.Индексы.Добавить("Client");
	
	НайденныеСтроки = ТаблицаСтрокRevenueРасширенная.НайтиСтроки(Новый Структура("Client", Справочники.Контрагенты.Unallocated));
	
	НЗ_Clients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_Clients.Отбор.Период.Установить(НачалоМесяца(Дата));
	НЗ_Clients.Отбор.ТипСоответствия.Установить(ТипВнешнейСистемы);
	НЗ_Clients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	НЗ_ParentClients = РегистрыСведений.НастройкаСинхронизацииОбъектовСВнешнимиСистемами.СоздатьНаборЗаписей();
	НЗ_ParentClients.Отбор.Период.Установить(НачалоМесяца(Дата));
	НЗ_ParentClients.Отбор.ТипСоответствия.Установить(Перечисления.ТипыСоответствий.ParentClients);
	НЗ_ParentClients.Отбор.ТипОбъектаВнешнейСистемы.Установить(Перечисления.ТипыОбъектовВнешнихСистем.Client);
	
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		НЗ_Clients.Очистить();
		НЗ_Clients.Отбор.Идентификатор.Установить(НайденнаяСтрока.BillingID);
		Запись = НЗ_Clients.Добавить();
		Запись.Период = НачалоМесяца(Дата);
		Запись.ТипСоответствия = ТипВнешнейСистемы;
		Запись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
		Запись.Идентификатор = НайденнаяСтрока.BillingID;
		Запись.ОбъектПриемника = НайденнаяСтрока.Client;
		НЗ_Clients.Записать(Истина);
		Если Не ЗначениеЗаполнено(НайденнаяСтрока.ParentClient) Тогда
			НЗ_ParentClients.Очистить();
			НЗ_ParentClients.Отбор.Идентификатор.Установить(НайденнаяСтрока.ParentClientID);
			Запись = НЗ_ParentClients.Добавить();
			Запись.Период = НачалоМесяца(Дата);
			Запись.ТипСоответствия = Перечисления.ТипыСоответствий.ParentClients;
			Запись.ТипОбъектаВнешнейСистемы = Перечисления.ТипыОбъектовВнешнихСистем.Client;
			Запись.Идентификатор = НайденнаяСтрока.ParentClientID;
			Запись.ОбъектПриемника = НайденнаяСтрока.ParentClient;
			НЗ_ParentClients.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДвиженияRevenueByClients = Движения.RevenueByClients;
	ДвиженияRevenueByClients.Записывать = Истина;
	ДвиженияRevenueByClients.Очистить();
	ДвиженияRevenueByClients.Записать(Истина);
	
	
КонецПроцедуры
